mysql-cheatsheet.org
#+title: MySQL Cheat Sheet
#+author: Manos Vasilakis (advizor.gr)

* MySQL Cheat Sheet

** Login
#+BEGIN_SRC <sh>
mysql -u root -p
#+END_SRC

** Show Users
#+BEGIN_SRC <sql>
SELECT User, Host FROM mysql.user;
#+END_SRC

** Create User
#+BEGIN_SRC <sql>
CREATE USER 'someuser'@'localhost' IDENTIFIED BY 'somepassword';
#+END_SRC

** Grant All Privileges On All Databases
#+BEGIN_SRC <sql>
GRANT ALL PRIVILEGES ON * . * TO 'someuser'@'localhost';
FLUSH PRIVILEGES;
#+END_SRC

** Show Grants
#+BEGIN_SRC <sql>
SHOW GRANTS FOR 'someuser'@'localhost';
#+END_SRC

** Remove Grants
#+BEGIN_SRC <sql>
REVOKE ALL PRIVILEGES, GRANT OPTION FROM 'someuser'@'localhost';
#+END_SRC

** Delete User
#+BEGIN_SRC <sql>
DROP USER 'someuser'@'localhost';
#+END_SRC

** Exit
#+BEGIN_SRC <sql>
exit;
#+END_SRC

** Show Databases
#+BEGIN_SRC <sql>
SHOW DATABASES
#+END_SRC

** Create Database
#+BEGIN_SRC <sql>
CREATE DATABASE acme;
#+END_SRC

** Delete Database
#+BEGIN_SRC <sql>
DROP DATABASE acme;
#+END_SRC

** Select Database
#+BEGIN_SRC <sql>
USE acme;
#+END_SRC

** Create Table
#+BEGIN_SRC <sql>
CREATE TABLE users(
id INT AUTO_INCREMENT,
   first_name VARCHAR(100),
   last_name VARCHAR(100),
   email VARCHAR(50),
   password VARCHAR(20),
   location VARCHAR(100),
   dept VARCHAR(100),
   is_admin TINYINT(1),
   register_date DATETIME,
   PRIMARY KEY(id)
);
#+END_SRC

** Delete / Drop Table
#+BEGIN_SRC <sql>
DROP TABLE tablename;
#+END_SRC

** Show Tables
#+BEGIN_SRC <sql>
SHOW TABLES;
#+END_SRC

** Insert Row / Record
#+BEGIN_SRC <sql>
INSERT INTO users (first_name, last_name, email, password, location, dept, is_admin, register_date) values ('Brad', 'Traversy', 'brad@gmail.com', '123456','Massachusetts', 'development', 1, now());
#+END_SRC

** Insert Multiple Rows
#+BEGIN_SRC <sql>
INSERT INTO users (first_name, last_name, email, password, location, dept,  is_admin, register_date) values ('Fred', 'Smith', 'fred@gmail.com', '123456', 'New York', 'design', 0, now()), ('Sara', 'Watson', 'sara@gmail.com', '123456', 'New York', 'design', 0, now()),('Will', 'Jackson', 'will@yahoo.com', '123456', 'Rhode Island', 'development', 1, now()),('Paula', 'Johnson', 'paula@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now()),('Tom', 'Spears', 'tom@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now());
#+END_SRC

** Select
#+BEGIN_SRC <sql>
SELECT * FROM users;
SELECT first_name, last_name FROM users;
#+END_SRC

** Where Clause
#+BEGIN_SRC <sql>
SELECT * FROM users WHERE location='Massachusetts';
SELECT * FROM users WHERE location='Massachusetts' AND dept='sales';
SELECT * FROM users WHERE is_admin = 1;
SELECT * FROM users WHERE is_admin > 0;
#+END_SRC

** Delete Row
#+BEGIN_SRC <sql>
DELETE FROM users WHERE id = 6;
#+END_SRC

** Update Row
#+BEGIN_SRC <sql>
UPDATE users SET email = 'freddy@gmail.com' WHERE id = 2;

#+END_SRC

** Add New Column
#+BEGIN_SRC <sql>
ALTER TABLE users ADD age VARCHAR(3);
#+END_SRC

** Modify Column
#+BEGIN_SRC <sql>
ALTER TABLE users MODIFY COLUMN age INT(3);
#+END_SRC

** Order By (Sort)
#+BEGIN_SRC <sql>
SELECT * FROM users ORDER BY last_name ASC;
SELECT * FROM users ORDER BY last_name DESC;
#+END_SRC

** Concatenate Columns
#+BEGIN_SRC <sql>
SELECT CONCAT(first_name, ' ', last_name) AS 'Name', dept FROM users;
#+END_SRC

** Select Distinct Rows
#+BEGIN_SRC <sql>
SELECT DISTINCT location FROM users;

#+END_SRC

** Between (Select Range)
#+BEGIN_SRC <sql>
SELECT * FROM users WHERE age BETWEEN 20 AND 25;
#+END_SRC

** Like (Searching)
#+BEGIN_SRC <sql>
SELECT * FROM users WHERE dept LIKE 'd%';
SELECT * FROM users WHERE dept LIKE 'dev%';
SELECT * FROM users WHERE dept LIKE '%t';
SELECT * FROM users WHERE dept LIKE '%e%';
#+END_SRC

** Not Like
#+BEGIN_SRC <sql>
SELECT * FROM users WHERE dept NOT LIKE 'd%';
#+END_SRC

** IN
#+BEGIN_SRC <sql>
SELECT * FROM users WHERE dept IN ('design', 'sales');
#+END_SRC

** Create & Remove Index
#+BEGIN_SRC <sql>
CREATE INDEX LIndex On users(location);
DROP INDEX LIndex ON users;
#+END_SRC

** New Table With Foreign Key (Posts)
#+BEGIN_SRC <sql>
CREATE TABLE posts(
id INT AUTO_INCREMENT,
   user_id INT,
   title VARCHAR(100),
   body TEXT,
   publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
   PRIMARY KEY(id),
   FOREIGN KEY (user_id) REFERENCES users(id)
);
#+END_SRC

** Add Data to Posts Table
#+BEGIN_SRC <sql>
INSERT INTO posts(user_id, title, body) VALUES (1, 'Post One', 'This is post one'),(3, 'Post Two', 'This is post two'),(1, 'Post Three', 'This is post three'),(2, 'Post Four', 'This is post four'),(5, 'Post Five', 'This is post five'),(4, 'Post Six', 'This is post six'),(2, 'Post Seven', 'This is post seven'),(1, 'Post Eight', 'This is post eight'),(3, 'Post Nine', 'This is post none'),(4, 'Post Ten', 'This is post ten');
#+END_SRC

** INNER JOIN
#+BEGIN_SRC <sql>
SELECT
  users.first_name,
  users.last_name,
  posts.title,
  posts.publish_date
FROM users
INNER JOIN posts
ON users.id = posts.user_id
ORDER BY posts.title;
#+END_SRC

** New Table With 2 Foriegn Keys
#+BEGIN_SRC <sql>
CREATE TABLE comments(
	id INT AUTO_INCREMENT,
    post_id INT,
    user_id INT,
    body TEXT,
    publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
    PRIMARY KEY(id),
    FOREIGN KEY(user_id) references users(id),
    FOREIGN KEY(post_id) references posts(id)
);
#+END_SRC

** Add Data to Comments Table
#+BEGIN_SRC <sql>
INSERT INTO comments(post_id, user_id, body) VALUES (1, 3, 'This is comment one'),(2, 1, 'This is comment two'),(5, 3, 'This is comment three'),(2, 4, 'This is comment four'),(1, 2, 'This is comment five'),(3, 1, 'This is comment six'),(3, 2, 'This is comment six'),(5, 4, 'This is comment seven'),(2, 3, 'This is comment seven');
#+END_SRC

** Left Join
#+BEGIN_SRC <sql>
SELECT
comments.body,
posts.title
FROM comments
LEFT JOIN posts ON posts.id = comments.post_id
ORDER BY posts.title;
#+END_SRC

** Join Multiple Tables
#+BEGIN_SRC <sql>
SELECT
comments.body,
posts.title,
users.first_name,
users.last_name
FROM comments
INNER JOIN posts on posts.id = comments.post_id
INNER JOIN users on users.id = comments.user_id
ORDER BY posts.title;
#+END_SRC

** Aggregate Functions
#+BEGIN_SRC <sql>
SELECT COUNT(id) FROM users;
SELECT MAX(age) FROM users;
SELECT MIN(age) FROM users;
SELECT SUM(age) FROM users;
SELECT UCASE(first_name), LCASE(last_name) FROM users;
#+END_SRC

** Group By
#+BEGIN_SRC <sql>
SELECT age, COUNT(age) FROM users GROUP BY age;
SELECT age, COUNT(age) FROM users WHERE age > 20 GROUP BY age;
SELECT age, COUNT(age) FROM users GROUP BY age HAVING count(age) >=2;
#+END_SRC
