html/mysql-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-16 Thu 22:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL Cheat Sheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Manos Vasilakis (advizor.gr)" />
<link rel="stylesheet" type="text/css" href="./css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">MySQL Cheat Sheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12e986f">1. MySQL Cheat Sheet</a>
<ul>
<li><a href="#org8afbd2f">1.1. Login</a></li>
<li><a href="#org729a3bf">1.2. Show Users</a></li>
<li><a href="#org8969625">1.3. Create User</a></li>
<li><a href="#org0221efd">1.4. Grant All Privileges On All Databases</a></li>
<li><a href="#org5e6bba7">1.5. Show Grants</a></li>
<li><a href="#org22272b7">1.6. Remove Grants</a></li>
<li><a href="#orga0ad18c">1.7. Delete User</a></li>
<li><a href="#orgd60982c">1.8. Exit</a></li>
<li><a href="#org0bd569d">1.9. Show Databases</a></li>
<li><a href="#org1c585b2">1.10. Create Database</a></li>
<li><a href="#orgf0aa6f7">1.11. Delete Database</a></li>
<li><a href="#orgb928344">1.12. Select Database</a></li>
<li><a href="#orgdc07020">1.13. Create Table</a></li>
<li><a href="#org7b82119">1.14. Delete / Drop Table</a></li>
<li><a href="#org4fc4fac">1.15. Show Tables</a></li>
<li><a href="#org6017897">1.16. Insert Row / Record</a></li>
<li><a href="#orgef55be6">1.17. Insert Multiple Rows</a></li>
<li><a href="#orgee1b1b9">1.18. Select</a></li>
<li><a href="#orgb6e275e">1.19. Where Clause</a></li>
<li><a href="#org66586c8">1.20. Delete Row</a></li>
<li><a href="#org9430acc">1.21. Update Row</a></li>
<li><a href="#orgd8db7f4">1.22. Add New Column</a></li>
<li><a href="#org497a6af">1.23. Modify Column</a></li>
<li><a href="#org9e37325">1.24. Order By (Sort)</a></li>
<li><a href="#org72b12b4">1.25. Concatenate Columns</a></li>
<li><a href="#org6946a35">1.26. Select Distinct Rows</a></li>
<li><a href="#org45a4f49">1.27. Between (Select Range)</a></li>
<li><a href="#orga3f439a">1.28. Like (Searching)</a></li>
<li><a href="#org1dc3cb8">1.29. Not Like</a></li>
<li><a href="#org0833747">1.30. IN</a></li>
<li><a href="#orgef6a895">1.31. Create &amp; Remove Index</a></li>
<li><a href="#org0805b66">1.32. New Table With Foreign Key (Posts)</a></li>
<li><a href="#orgda460d6">1.33. Add Data to Posts Table</a></li>
<li><a href="#org3a27a54">1.34. INNER JOIN</a></li>
<li><a href="#orgd6fc924">1.35. New Table With 2 Foriegn Keys</a></li>
<li><a href="#orge823d61">1.36. Add Data to Comments Table</a></li>
<li><a href="#orga4b0a6c">1.37. Left Join</a></li>
<li><a href="#org4a28461">1.38. Join Multiple Tables</a></li>
<li><a href="#org3f83511">1.39. Aggregate Functions</a></li>
<li><a href="#org39a8686">1.40. Group By</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org12e986f" class="outline-2">
<h2 id="org12e986f"><span class="section-number-2">1</span> MySQL Cheat Sheet</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8afbd2f" class="outline-3">
<h3 id="org8afbd2f"><span class="section-number-3">1.1</span> Login</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-sh">mysql -u root -p
</pre>
</div>
</div>
</div>

<div id="outline-container-org729a3bf" class="outline-3">
<h3 id="org729a3bf"><span class="section-number-3">1.2</span> Show Users</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-sql">SELECT User, Host FROM mysql.user;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8969625" class="outline-3">
<h3 id="org8969625"><span class="section-number-3">1.3</span> Create User</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sql">CREATE USER 'someuser'@'localhost' IDENTIFIED BY 'somepassword';
</pre>
</div>
</div>
</div>

<div id="outline-container-org0221efd" class="outline-3">
<h3 id="org0221efd"><span class="section-number-3">1.4</span> Grant All Privileges On All Databases</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-sql">GRANT ALL PRIVILEGES ON * . * TO 'someuser'@'localhost';
FLUSH PRIVILEGES;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e6bba7" class="outline-3">
<h3 id="org5e6bba7"><span class="section-number-3">1.5</span> Show Grants</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS FOR 'someuser'@'localhost';
</pre>
</div>
</div>
</div>

<div id="outline-container-org22272b7" class="outline-3">
<h3 id="org22272b7"><span class="section-number-3">1.6</span> Remove Grants</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-sql">REVOKE ALL PRIVILEGES, GRANT OPTION FROM 'someuser'@'localhost';
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0ad18c" class="outline-3">
<h3 id="orga0ad18c"><span class="section-number-3">1.7</span> Delete User</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-sql">DROP USER 'someuser'@'localhost';
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd60982c" class="outline-3">
<h3 id="orgd60982c"><span class="section-number-3">1.8</span> Exit</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-sql">exit;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bd569d" class="outline-3">
<h3 id="org0bd569d"><span class="section-number-3">1.9</span> Show Databases</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-sql">SHOW DATABASES
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c585b2" class="outline-3">
<h3 id="org1c585b2"><span class="section-number-3">1.10</span> Create Database</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">
<pre class="src src-sql">CREATE DATABASE acme;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0aa6f7" class="outline-3">
<h3 id="orgf0aa6f7"><span class="section-number-3">1.11</span> Delete Database</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-sql">DROP DATABASE acme;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb928344" class="outline-3">
<h3 id="orgb928344"><span class="section-number-3">1.12</span> Select Database</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-sql">USE acme;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc07020" class="outline-3">
<h3 id="orgdc07020"><span class="section-number-3">1.13</span> Create Table</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-sql">CREATE TABLE users(
id INT AUTO_INCREMENT,
   first_name VARCHAR(100),
   last_name VARCHAR(100),
   email VARCHAR(50),
   password VARCHAR(20),
   location VARCHAR(100),
   dept VARCHAR(100),
   is_admin TINYINT(1),
   register_date DATETIME,
   PRIMARY KEY(id)
);
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b82119" class="outline-3">
<h3 id="org7b82119"><span class="section-number-3">1.14</span> Delete / Drop Table</h3>
<div class="outline-text-3" id="text-1-14">
<div class="org-src-container">
<pre class="src src-sql">DROP TABLE tablename;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fc4fac" class="outline-3">
<h3 id="org4fc4fac"><span class="section-number-3">1.15</span> Show Tables</h3>
<div class="outline-text-3" id="text-1-15">
<div class="org-src-container">
<pre class="src src-sql">SHOW TABLES;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6017897" class="outline-3">
<h3 id="org6017897"><span class="section-number-3">1.16</span> Insert Row / Record</h3>
<div class="outline-text-3" id="text-1-16">
<div class="org-src-container">
<pre class="src src-sql">INSERT INTO users (first_name, last_name, email, password, location, dept, is_admin, register_date) values ('Brad', 'Traversy', 'brad@gmail.com', '123456','Massachusetts', 'development', 1, now());
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef55be6" class="outline-3">
<h3 id="orgef55be6"><span class="section-number-3">1.17</span> Insert Multiple Rows</h3>
<div class="outline-text-3" id="text-1-17">
<div class="org-src-container">
<pre class="src src-sql">INSERT INTO users (first_name, last_name, email, password, location, dept,  is_admin, register_date) values ('Fred', 'Smith', 'fred@gmail.com', '123456', 'New York', 'design', 0, now()), ('Sara', 'Watson', 'sara@gmail.com', '123456', 'New York', 'design', 0, now()),('Will', 'Jackson', 'will@yahoo.com', '123456', 'Rhode Island', 'development', 1, now()),('Paula', 'Johnson', 'paula@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now()),('Tom', 'Spears', 'tom@yahoo.com', '123456', 'Massachusetts', 'sales', 0, now());
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee1b1b9" class="outline-3">
<h3 id="orgee1b1b9"><span class="section-number-3">1.18</span> Select</h3>
<div class="outline-text-3" id="text-1-18">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users;
SELECT first_name, last_name FROM users;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb6e275e" class="outline-3">
<h3 id="orgb6e275e"><span class="section-number-3">1.19</span> Where Clause</h3>
<div class="outline-text-3" id="text-1-19">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users WHERE location='Massachusetts';
SELECT * FROM users WHERE location='Massachusetts' AND dept='sales';
SELECT * FROM users WHERE is_admin = 1;
SELECT * FROM users WHERE is_admin &gt; 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org66586c8" class="outline-3">
<h3 id="org66586c8"><span class="section-number-3">1.20</span> Delete Row</h3>
<div class="outline-text-3" id="text-1-20">
<div class="org-src-container">
<pre class="src src-sql">DELETE FROM users WHERE id = 6;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9430acc" class="outline-3">
<h3 id="org9430acc"><span class="section-number-3">1.21</span> Update Row</h3>
<div class="outline-text-3" id="text-1-21">
<div class="org-src-container">
<pre class="src src-sql">UPDATE users SET email = 'freddy@gmail.com' WHERE id = 2;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8db7f4" class="outline-3">
<h3 id="orgd8db7f4"><span class="section-number-3">1.22</span> Add New Column</h3>
<div class="outline-text-3" id="text-1-22">
<div class="org-src-container">
<pre class="src src-sql">ALTER TABLE users ADD age VARCHAR(3);
</pre>
</div>
</div>
</div>

<div id="outline-container-org497a6af" class="outline-3">
<h3 id="org497a6af"><span class="section-number-3">1.23</span> Modify Column</h3>
<div class="outline-text-3" id="text-1-23">
<div class="org-src-container">
<pre class="src src-sql">ALTER TABLE users MODIFY COLUMN age INT(3);
</pre>
</div>
</div>
</div>

<div id="outline-container-org9e37325" class="outline-3">
<h3 id="org9e37325"><span class="section-number-3">1.24</span> Order By (Sort)</h3>
<div class="outline-text-3" id="text-1-24">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users ORDER BY last_name ASC;
SELECT * FROM users ORDER BY last_name DESC;
</pre>
</div>
</div>
</div>

<div id="outline-container-org72b12b4" class="outline-3">
<h3 id="org72b12b4"><span class="section-number-3">1.25</span> Concatenate Columns</h3>
<div class="outline-text-3" id="text-1-25">
<div class="org-src-container">
<pre class="src src-sql">SELECT CONCAT(first_name, ' ', last_name) AS 'Name', dept FROM users;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6946a35" class="outline-3">
<h3 id="org6946a35"><span class="section-number-3">1.26</span> Select Distinct Rows</h3>
<div class="outline-text-3" id="text-1-26">
<div class="org-src-container">
<pre class="src src-sql">SELECT DISTINCT location FROM users;
</pre>
</div>
</div>
</div>

<div id="outline-container-org45a4f49" class="outline-3">
<h3 id="org45a4f49"><span class="section-number-3">1.27</span> Between (Select Range)</h3>
<div class="outline-text-3" id="text-1-27">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users WHERE age BETWEEN 20 AND 25;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga3f439a" class="outline-3">
<h3 id="orga3f439a"><span class="section-number-3">1.28</span> Like (Searching)</h3>
<div class="outline-text-3" id="text-1-28">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users WHERE dept LIKE 'd%';
SELECT * FROM users WHERE dept LIKE 'dev%';
SELECT * FROM users WHERE dept LIKE '%t';
SELECT * FROM users WHERE dept LIKE '%e%';
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dc3cb8" class="outline-3">
<h3 id="org1dc3cb8"><span class="section-number-3">1.29</span> Not Like</h3>
<div class="outline-text-3" id="text-1-29">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users WHERE dept NOT LIKE 'd%';
</pre>
</div>
</div>
</div>

<div id="outline-container-org0833747" class="outline-3">
<h3 id="org0833747"><span class="section-number-3">1.30</span> IN</h3>
<div class="outline-text-3" id="text-1-30">
<div class="org-src-container">
<pre class="src src-sql">SELECT * FROM users WHERE dept IN ('design', 'sales');
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef6a895" class="outline-3">
<h3 id="orgef6a895"><span class="section-number-3">1.31</span> Create &amp; Remove Index</h3>
<div class="outline-text-3" id="text-1-31">
<div class="org-src-container">
<pre class="src src-sql">CREATE INDEX LIndex On users(location);
DROP INDEX LIndex ON users;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0805b66" class="outline-3">
<h3 id="org0805b66"><span class="section-number-3">1.32</span> New Table With Foreign Key (Posts)</h3>
<div class="outline-text-3" id="text-1-32">
<div class="org-src-container">
<pre class="src src-sql">CREATE TABLE posts(
id INT AUTO_INCREMENT,
   user_id INT,
   title VARCHAR(100),
   body TEXT,
   publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
   PRIMARY KEY(id),
   FOREIGN KEY (user_id) REFERENCES users(id)
);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda460d6" class="outline-3">
<h3 id="orgda460d6"><span class="section-number-3">1.33</span> Add Data to Posts Table</h3>
<div class="outline-text-3" id="text-1-33">
<div class="org-src-container">
<pre class="src src-sql">INSERT INTO posts(user_id, title, body) VALUES (1, 'Post One', 'This is post one'),(3, 'Post Two', 'This is post two'),(1, 'Post Three', 'This is post three'),(2, 'Post Four', 'This is post four'),(5, 'Post Five', 'This is post five'),(4, 'Post Six', 'This is post six'),(2, 'Post Seven', 'This is post seven'),(1, 'Post Eight', 'This is post eight'),(3, 'Post Nine', 'This is post none'),(4, 'Post Ten', 'This is post ten');
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a27a54" class="outline-3">
<h3 id="org3a27a54"><span class="section-number-3">1.34</span> INNER JOIN</h3>
<div class="outline-text-3" id="text-1-34">
<div class="org-src-container">
<pre class="src src-sql">SELECT
  users.first_name,
  users.last_name,
  posts.title,
  posts.publish_date
FROM users
INNER JOIN posts
ON users.id = posts.user_id
ORDER BY posts.title;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6fc924" class="outline-3">
<h3 id="orgd6fc924"><span class="section-number-3">1.35</span> New Table With 2 Foriegn Keys</h3>
<div class="outline-text-3" id="text-1-35">
<div class="org-src-container">
<pre class="src src-sql">CREATE TABLE comments(
	id INT AUTO_INCREMENT,
    post_id INT,
    user_id INT,
    body TEXT,
    publish_date DATETIME DEFAULT CURRENT_TIMESTAMP,
    PRIMARY KEY(id),
    FOREIGN KEY(user_id) references users(id),
    FOREIGN KEY(post_id) references posts(id)
);
</pre>
</div>
</div>
</div>

<div id="outline-container-orge823d61" class="outline-3">
<h3 id="orge823d61"><span class="section-number-3">1.36</span> Add Data to Comments Table</h3>
<div class="outline-text-3" id="text-1-36">
<div class="org-src-container">
<pre class="src src-sql">INSERT INTO comments(post_id, user_id, body) VALUES (1, 3, 'This is comment one'),(2, 1, 'This is comment two'),(5, 3, 'This is comment three'),(2, 4, 'This is comment four'),(1, 2, 'This is comment five'),(3, 1, 'This is comment six'),(3, 2, 'This is comment six'),(5, 4, 'This is comment seven'),(2, 3, 'This is comment seven');
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4b0a6c" class="outline-3">
<h3 id="orga4b0a6c"><span class="section-number-3">1.37</span> Left Join</h3>
<div class="outline-text-3" id="text-1-37">
<div class="org-src-container">
<pre class="src src-sql">SELECT
comments.body,
posts.title
FROM comments
LEFT JOIN posts ON posts.id = comments.post_id
ORDER BY posts.title;
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a28461" class="outline-3">
<h3 id="org4a28461"><span class="section-number-3">1.38</span> Join Multiple Tables</h3>
<div class="outline-text-3" id="text-1-38">
<div class="org-src-container">
<pre class="src src-sql">SELECT
comments.body,
posts.title,
users.first_name,
users.last_name
FROM comments
INNER JOIN posts on posts.id = comments.post_id
INNER JOIN users on users.id = comments.user_id
ORDER BY posts.title;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f83511" class="outline-3">
<h3 id="org3f83511"><span class="section-number-3">1.39</span> Aggregate Functions</h3>
<div class="outline-text-3" id="text-1-39">
<div class="org-src-container">
<pre class="src src-sql">SELECT COUNT(id) FROM users;
SELECT MAX(age) FROM users;
SELECT MIN(age) FROM users;
SELECT SUM(age) FROM users;
SELECT UCASE(first_name), LCASE(last_name) FROM users;
</pre>
</div>
</div>
</div>

<div id="outline-container-org39a8686" class="outline-3">
<h3 id="org39a8686"><span class="section-number-3">1.40</span> Group By</h3>
<div class="outline-text-3" id="text-1-40">
<div class="org-src-container">
<pre class="src src-sql">SELECT age, COUNT(age) FROM users GROUP BY age;
SELECT age, COUNT(age) FROM users WHERE age &gt; 20 GROUP BY age;
SELECT age, COUNT(age) FROM users GROUP BY age HAVING count(age) &gt;=2;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manos Vasilakis (advizor.gr)</p>
<p class="date">Created: 2021-09-16 Thu 22:51</p>
</div>
</body>
</html>
